# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions..::..Dispose Method
IFCImportOptions Class See Also
---
Releases all resources used by the IFCImportOptions
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace